In [1]:
#import dependencies
import pandas as pd

In [2]:
#import file from excel format and create a dataframe
df=pd.read_excel("shopify_sneakers.xlsx", index_col="order_id")
df

,shop_id,user_id,order_amount,total_items,payment_method,created_at
order_id,,,,,,
1,53,746,224,2,cash,2017-03-13 12:36:56.190022
2,92,925,90,1,cash,2017-03-03 17:38:51.999116
3,44,861,144,1,cash,2017-03-14 04:23:55.594730
4,18,935,156,1,credit_card,2017-03-26 12:43:36.648760
5,18,883,156,1,credit_card,2017-03-01 04:35:10.772536
...,...,...,...,...,...,...
4996,73,993,330,2,debit,2017-03-30 13:47:16.596993
4997,48,789,234,2,cash,2017-03-16 20:36:16.389130
4998,56,867,351,3,cash,2017-03-19 05:42:42.228042
4999,60,825,354,2,credit_card,2017-03-16 14:51:18.187847
5000,44,734,288,2,debit,2017-03-18 15:48:18.205423

In [3]:
#explore dtypes
df.dtypes

shop_id                    int64
user_id                    int64
order_amount               int64
total_items                int64
payment_method            object
created_at        datetime64[ns]
dtype: object

In [4]:
#Are their many duplicates?
df_dupes=pd.DataFrame.duplicated(df)
df_dupes.value_counts()

False    4995
True        5
dtype: int64

In [5]:
#recreate calculation AOV = 3145.13
(df["order_amount"].sum())/(df["order_amount"].count())

3145.128

In [40]:
#dataframe mean, median, mode
print(df["order_amount"].mean())
print(df["order_amount"].median())
df["order_amount"].mode()

3145.128
284.0

0    153
dtype: int64

In [6]:
#Check the start and end dates to ensure that the whole dataset is within 30 days
print(df["created_at"].min())
df["created_at"].max()

2017-03-01 00:08:09.178666

Timestamp('2017-03-30 23:55:35.408000')

In [7]:
#inspect the order amount column
print(df["order_amount"].min())
df["order_amount"].max()

90

704000

In [8]:
#inspect the order quantity column
print(df["total_items"].min())
df["total_items"].max()

1

2000

In [41]:
#inspect central tendency of units per transaction
print(df["total_items"].mean())
print(df["total_items"].median())
df["total_items"].mode()

8.7872
2.0

0    2
dtype: int64

In [9]:
#create a "high spend" dataframe to observe similarities by $ amount
high_spend_df=df.loc[df["order_amount"]==704000]
print(high_spend_df.count())
high_spend_df

shop_id           17
user_id           17
order_amount      17
total_items       17
payment_method    17
created_at        17
dtype: int64

,shop_id,user_id,order_amount,total_items,payment_method,created_at
order_id,,,,,,
16,42,607,704000,2000,credit_card,2017-03-07 04:00:00
61,42,607,704000,2000,credit_card,2017-03-04 04:00:00
521,42,607,704000,2000,credit_card,2017-03-02 04:00:00
1105,42,607,704000,2000,credit_card,2017-03-24 04:00:00
1363,42,607,704000,2000,credit_card,2017-03-15 04:00:00
1437,42,607,704000,2000,credit_card,2017-03-11 04:00:00
1563,42,607,704000,2000,credit_card,2017-03-19 04:00:00
1603,42,607,704000,2000,credit_card,2017-03-17 04:00:00
2154,42,607,704000,2000,credit_card,2017-03-12 04:00:00
2298,42,607,704000,2000,credit_card,2017-03-07 04:00:00
2836,42,607,704000,2000,credit_card,2017-03-28 04:00:00
2970,42,607,704000,2000,credit_card,2017-03-28 04:00:00
3333,42,607,704000,2000,credit_card,2017-03-24 04:00:00
4057,42,607,704000,2000,credit_card,2017-03-28 04:00:00
4647,42,607,704000,2000,credit_card,2017-03-02 04:00:00
4869,42,607,704000,2000,credit_card,2017-03-22 04:00:00
4883,42,607,704000,2000,credit_card,2017-03-25 04:00:00

In [10]:
#create a "high totals" dataframe to observe similarities by unit -- Matches high_spend
high_totals_df=df.loc[df["total_items"]==2000]
print(high_totals_df.count())
high_totals_df

shop_id           17
user_id           17
order_amount      17
total_items       17
payment_method    17
created_at        17
dtype: int64

,shop_id,user_id,order_amount,total_items,payment_method,created_at
order_id,,,,,,
16,42,607,704000,2000,credit_card,2017-03-07 04:00:00
61,42,607,704000,2000,credit_card,2017-03-04 04:00:00
521,42,607,704000,2000,credit_card,2017-03-02 04:00:00
1105,42,607,704000,2000,credit_card,2017-03-24 04:00:00
1363,42,607,704000,2000,credit_card,2017-03-15 04:00:00
1437,42,607,704000,2000,credit_card,2017-03-11 04:00:00
1563,42,607,704000,2000,credit_card,2017-03-19 04:00:00
1603,42,607,704000,2000,credit_card,2017-03-17 04:00:00
2154,42,607,704000,2000,credit_card,2017-03-12 04:00:00
2298,42,607,704000,2000,credit_card,2017-03-07 04:00:00
2836,42,607,704000,2000,credit_card,2017-03-28 04:00:00
2970,42,607,704000,2000,credit_card,2017-03-28 04:00:00
3333,42,607,704000,2000,credit_card,2017-03-24 04:00:00
4057,42,607,704000,2000,credit_card,2017-03-28 04:00:00
4647,42,607,704000,2000,credit_card,2017-03-02 04:00:00
4869,42,607,704000,2000,credit_card,2017-03-22 04:00:00
4883,42,607,704000,2000,credit_card,2017-03-25 04:00:00

In [35]:
#create a store 42 dataframe to investigate the trends at that store.
store_42_df=df.loc[df["shop_id"]==42]
print((store_42_df).count())
print(store_42_df["order_amount"].mean())
print(store_42_df["order_amount"].median())
print(store_42_df["order_amount"].mode())
store_42_df

shop_id           51
user_id           51
order_amount      51
total_items       51
payment_method    51
created_at        51
avg_item_cost     51
dtype: int64
235101.49019607843
704.0
0    704000
dtype: int64

,shop_id,user_id,order_amount,total_items,payment_method,created_at,avg_item_cost
order_id,,,,,,,
16,42,607,704000,2000,credit_card,2017-03-07 04:00:00.000000,352.0
41,42,793,352,1,credit_card,2017-03-24 14:15:40.648596,352.0
61,42,607,704000,2000,credit_card,2017-03-04 04:00:00.000000,352.0
309,42,770,352,1,credit_card,2017-03-11 18:14:38.774201,352.0
410,42,904,704,2,credit_card,2017-03-04 14:32:57.620532,352.0
521,42,607,704000,2000,credit_card,2017-03-02 04:00:00.000000,352.0
835,42,792,352,1,cash,2017-03-25 21:31:24.595774,352.0
836,42,819,704,2,cash,2017-03-09 14:15:15.135510,352.0
939,42,808,1056,3,credit_card,2017-03-13 23:43:45.329731,352.0
980,42,744,352,1,debit,2017-03-12 13:09:03.570060,352.0
1105,42,607,704000,2000,credit_card,2017-03-24 04:00:00.000000,352.0
1363,42,607,704000,2000,credit_card,2017-03-15 04:00:00.000000,352.0
1365,42,797,1760,5,cash,2017-03-10 06:28:21.039264,352.0
1368,42,926,1408,4,cash,2017-03-13 02:38:33.953460,352.0
1437,42,607,704000,2000,credit_card,2017-03-11 04:00:00.000000,352.0
1472,42,907,1408,4,debit,2017-03-12 23:00:21.521228,352.0
1513,42,946,352,1,debit,2017-03-24 13:35:04.114517,352.0
1521,42,756,704,2,debit,2017-03-22 13:10:31.447593,352.0
1563,42,607,704000,2000,credit_card,2017-03-19 04:00:00.000000,352.0
1603,42,607,704000,2000,credit_card,2017-03-17 04:00:00.000000,352.0
1912,42,739,704,2,cash,2017-03-07 05:42:52.153563,352.0
1930,42,770,352,1,credit_card,2017-03-17 08:11:13.184042,352.0
2004,42,934,704,2,cash,2017-03-26 09:21:25.915566,352.0
2019,42,739,352,1,debit,2017-03-01 12:42:25.759416,352.0
2054,42,951,352,1,debit,2017-03-19 11:49:12.071393,352.0
2154,42,607,704000,2000,credit_card,2017-03-12 04:00:00.000000,352.0
2274,42,747,704,2,debit,2017-03-27 20:48:19.095376,352.0
2298,42,607,704000,2000,credit_card,2017-03-07 04:00:00.000000,352.0
2492,42,868,704,2,debit,2017-03-01 18:33:33.377425,352.0
2610,42,868,704,2,debit,2017-03-23 18:10:13.528566,352.0
2767,42,970,704,2,credit_card,2017-03-05 10:45:41.577085,352.0
2836,42,607,704000,2000,credit_card,2017-03-28 04:00:00.000000,352.0
2970,42,607,704000,2000,credit_card,2017-03-28 04:00:00.000000,352.0
2988,42,819,1056,3,cash,2017-03-03 09:09:25.326901,352.0
3333,42,607,704000,2000,credit_card,2017-03-24 04:00:00.000000,352.0
3514,42,726,1056,3,debit,2017-03-24 17:51:04.520382,352.0
3652,42,830,352,1,credit_card,2017-03-24 22:26:57.541560,352.0
3698,42,839,352,1,debit,2017-03-12 02:45:08.931540,352.0
3904,42,975,352,1,debit,2017-03-12 01:28:30.851744,352.0
3999,42,886,352,1,debit,2017-03-09 20:10:40.505123,352.0
4057,42,607,704000,2000,credit_card,2017-03-28 04:00:00.000000,352.0
4232,42,962,352,1,cash,2017-03-04 00:01:19.132995,352.0
4295,42,859,704,2,cash,2017-03-24 20:50:39.607424,352.0
4327,42,788,704,2,debit,2017-03-16 23:37:56.790584,352.0
4422,42,736,704,2,credit_card,2017-03-01 12:19:49.175065,352.0
4626,42,809,352,1,credit_card,2017-03-11 08:21:26.203977,352.0
4647,42,607,704000,2000,credit_card,2017-03-02 04:00:00.000000,352.0
4746,42,872,352,1,debit,2017-03-24 00:57:24.130128,352.0
4768,42,720,704,2,credit_card,2017-03-14 10:26:08.027250,352.0
4869,42,607,704000,2000,credit_card,2017-03-22 04:00:00.000000,352.0
4883,42,607,704000,2000,credit_card,2017-03-25 04:00:00.000000,352.0

In [12]:
#find the average shoe cost across all stores
df["avg_item_cost"]=df["order_amount"]/df["total_items"]
df

,shop_id,user_id,order_amount,total_items,payment_method,created_at,avg_item_cost
order_id,,,,,,,
1,53,746,224,2,cash,2017-03-13 12:36:56.190022,112.0
2,92,925,90,1,cash,2017-03-03 17:38:51.999116,90.0
3,44,861,144,1,cash,2017-03-14 04:23:55.594730,144.0
4,18,935,156,1,credit_card,2017-03-26 12:43:36.648760,156.0
5,18,883,156,1,credit_card,2017-03-01 04:35:10.772536,156.0
...,...,...,...,...,...,...,...
4996,73,993,330,2,debit,2017-03-30 13:47:16.596993,165.0
4997,48,789,234,2,cash,2017-03-16 20:36:16.389130,117.0
4998,56,867,351,3,cash,2017-03-19 05:42:42.228042,117.0
4999,60,825,354,2,credit_card,2017-03-16 14:51:18.187847,177.0
5000,44,734,288,2,debit,2017-03-18 15:48:18.205423,144.0

In [36]:
df_sorted=df.sort_values(by=["shop_id"])
df_sorted

,shop_id,user_id,order_amount,total_items,payment_method,created_at,avg_item_cost
order_id,,,,,,,
4516,1,797,316,2,cash,2017-03-17 16:43:51.448549,158.0
4658,1,886,316,2,debit,2017-03-02 19:20:23.837641,158.0
1191,1,734,316,2,debit,2017-03-03 03:40:14.564303,158.0
348,1,907,158,1,credit_card,2017-03-03 06:59:34.915266,158.0
2588,1,756,316,2,debit,2017-03-30 12:27:18.832036,158.0
...,...,...,...,...,...,...,...
650,100,851,222,2,debit,2017-03-07 06:02:56.364687,111.0
3982,100,818,111,1,cash,2017-03-23 21:34:26.766937,111.0
4205,100,847,333,3,debit,2017-03-18 11:13:19.814212,111.0
3990,100,889,333,3,debit,2017-03-05 00:13:44.408662,111.0
1211,100,765,111,1,debit,2017-03-30 08:31:13.121917,111.0

In [55]:
df2=df_sorted.loc[df_sorted.groupby(df["shop_id"])].mean()
# df2=df2.drop(columns=["user_id", "shop_id"])
df2

ValueError: Cannot index with multidimensional key